/*Програма до завдання №4 Модульної контрольної роботи №1
* "Задано 5 цілих додатних чисел. Знайти їх середнє арифметичне. В програмі
   повинен бути захист від введення некоректних даних."
  

*/
#include <stdio.h>//Підключаємо необхідні для роботи бібліотеки

int main() {
    int num1, num2, num3, num4, num5;//Оголошуємо змінні
    float average;

    printf("Введіть п'ять цілих додатних чисел:\n");// Просимо юзера ввести данні 

    // Зчитування п'яти чисел
    if (scanf_s("%d %d %d %d %d", &num1, &num2, &num3, &num4, &num5) != 5) {
        printf("Введено некоректні дані.\n");
        return 1;
    }

    // Перевірка на додатність чисел
    if (num1 <= 0 || num2 <= 0 || num3 <= 0 || num4 <= 0 || num5 <= 0) {
        printf("Введено некоректні дані. Числа повинні бути додатніми.\n");//Виводимо помилку на екран юзера
        return 1;
    }

    // Обчислення середнього арифметичного
    average = (num1 + num2 + num3 + num4 + num5) / 5.0;

    printf("Середнє арифметичне: %.2f\n", average);//Виводимо отримані дані на екран юзера

    return 0;//Кінець програми
}